In [1]:
import pandas as pd

df = pd.read_csv("person_info.csv", encoding='euc-kr')
df

    이름         출생일         사망일  나이   직업
0  홍길동  1920-07-25  1958-04-16  37  회사원
1  이순신  1876-06-13  1937-10-16  61   군인
2  이홍길  1820-05-12  1910-08-13  90   의사
3  곽재우  1867-11-07  1934-07-04  66  연구원
4  신나라  1907-05-27  1964-04-14  56  연구원
5  오기영  1813-03-15  1858-06-16  45  연구원
6  기충현  1912-06-23  1954-06-07  41  회사원
7  심기한  1777-04-30  1855-02-23  77   백수

## 출생일열과 사망일열이 날짜 타입이 아닌, 문자열 타입임을 확인

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      8 non-null      object
 1   출생일     8 non-null      object
 2   사망일     8 non-null      object
 3   나이      8 non-null      int64
 4   직업      8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

## 날짜 데이터가 문자열 타입이라면 연산을 할 수가 없음

In [3]:
df + df

       이름                   출생일                   사망일   나이      직업
0  홍길동홍길동  1920-07-251920-07-25  1958-04-161958-04-16   74  회사원회사원
1  이순신이순신  1876-06-131876-06-13  1937-10-161937-10-16  122    군인군인
2  이홍길이홍길  1820-05-121820-05-12  1910-08-131910-08-13  180    의사의사
3  곽재우곽재우  1867-11-071867-11-07  1934-07-041934-07-04  132  연구원연구원
4  신나라신나라  1907-05-271907-05-27  1964-04-141964-04-14  112  연구원연구원
5  오기영오기영  1813-03-151813-03-15  1858-06-161858-06-16   90  연구원연구원
6  기충현기충현  1912-06-231912-06-23  1954-06-071954-06-07   82  회사원회사원
7  심기한심기한  1777-04-301777-04-30  1855-02-231855-02-23  154    백수백수

## to_datetime() 함수는 문자열로 된 날짜 데이터를 날짜 타입으로 변환할 수 있음

In [4]:
df['출생일'] = pd.to_datetime(df['출생일'], format='%Y-%m-%d')
df['사망일'] = pd.to_datetime(df['사망일'], format='%Y-%m-%d')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      8 non-null      object
 1   출생일     8 non-null      datetime64[ns]
 2   사망일     8 non-null      datetime64[ns]
 3   나이      8 non-null      int64
 4   직업      8 non-null      object
dtypes: datetime64[ns](2), int64(1), object(2)
memory usage: 448.0+ bytes

## 이제 날짜 타입으로 변환했기 때문에 연산이 가능함

In [5]:
df['days'] = df['사망일'] - df['출생일']
df

    이름        출생일        사망일  나이   직업       days
0  홍길동 1920-07-25 1958-04-16  37  회사원 13779 days
1  이순신 1876-06-13 1937-10-16  61   군인 22404 days
2  이홍길 1820-05-12 1910-08-13  90   의사 32964 days
3  곽재우 1867-11-07 1934-07-04  66  연구원 24345 days
4  신나라 1907-05-27 1964-04-14  56  연구원 20777 days
5  오기영 1813-03-15 1858-06-16  45  연구원 16529 days
6  기충현 1912-06-23 1954-06-07  41  회사원 15324 days
7  심기한 1777-04-30 1855-02-23  77   백수 28422 days

## 날짜 타입의 열에서 년도만 추출하기

In [6]:
df['출생일'].dt.year

0    1920
1    1876
2    1820
3    1867
4    1907
5    1813
6    1912
7    1777
Name: 출생일, dtype: int64

## 날짜 타입의 열에서 월만 추출하기

In [7]:
df['출생일'].dt.month

0     7
1     6
2     5
3    11
4     5
5     3
6     6
7     4
Name: 출생일, dtype: int64

## 날짜 타입의 열에서 일만 추출하기

In [8]:
df['출생일'].dt.day

0    25
1    13
2    12
3     7
4    27
5    15
6    23
7    30
Name: 출생일, dtype: int64

### 좀 더 자세한 내용은 pd.to_datetime()에 대한 공식 문서를 확인해주세요.
https://pandas.pydata.org/docs/reference/api/pandas.to_datetime.html